web/app/controllers/api/events_controller.rb

  def index
    respond_with @events = Event.all
---
SELECT `events`.* FROM `events`

  def posts
    arr = Array.new
    arr2 = Array.new
    Event.find_by(params[:id]).posts.each do |post|
---
SELECT  `events`.* FROM `events`  WHERE (1) LIMIT 1
SELECT `posts`.* FROM `posts`  WHERE `posts`.`event_id` = 1