web/app/controllers/api/users_controller.rb

  def create
    @user = User.new(user_params)
    @user.save
---
INSERT INTO `users` (`age`, `created_at`, `email`, `password`, `updated_at`, `username`) VALUES (21, '2014-12-17 00:55:19', 'eee@ee.com', '12345678', '2014-12-17 00:55:19', 'eslamm')

  def show
    respond_with  User.find_by(params[:id])
---
SELECT  `users`.* FROM `users`  WHERE (1) LIMIT 1